book_store/app/views/pages/author_books.html.erb

SELECT "books".* FROM "books" WHERE "books"."author_id" = ?  [["author_id", 1]]
---

    <% @author.books.each do |book| %>