book_store/app/controllers/pages_controller.rb

  def authors
    @authors = Author.all
---
SELECT "authors".* FROM "authors"

  def books
    not_authorised unless current_user.has_role?(:books) || current_user.has_role?(:admin)
    @books = Book.all
    @books = @books.public_send(:title, params[:title]) if params[:title].present?
    @books = @books.public_send(:rating, params[:rating]) if params[:rating].present?
    @books = Author.all.public_send(:author, params[:author]).first.books if params[:author].present?
---
SELECT "books".* FROM "books" WHERE (price > '2') AND (price < '5')
SELECT "books".* FROM "books" WHERE (title like '%%') AND "books"."rating" IS NULL
SELECT  "authors".* FROM "authors" WHERE (last_name like '%Har%') ORDER BY "authors"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."author_id" = $1  [["author_id", 1]]

  def show_book
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def author_books
    @author = Author.find(params[:id])
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def stores
    @stores = Store.all
---
SELECT "stores".* FROM "stores"

  def show_store
    @store = Store.find(params[:id])
---
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]